UNSW-Neural-Stimulator/neural_stimulator_firmware_2022/firmware/BLE_DAC/BLE_DAC/NSTIM.cydsn/Generated_Source/PSoC6/BLE_config.h
    #if ((CY_BLE_CONFIG_CONTR_CORE == CY_BLE_CORE_CORTEX_M0P) && \
        (!defined BLE_1_bless_isr__INTC_CORTEXM0P_ASSIGNED))
        #error Enable BLE_1_bless_isr interrupt for the ARM CM0+ core in the interrupt configuration tab of \
            the Design-Wide Resources (DWR) file (project.cydwr)     
    #endif /* CY_BLE_CONFIG_CONTR_CORE == CY_BLE_CORE_CORTEX_M0P) */
#endif /* (CY_BLE_CONFIG_STACK_CONTR_CORE) */

/* Check for the proper UART ISR configuration in the DWR.  */
#if(CY_BLE_CONFIG_STACK_MODE_CONTR_UART)
    #if((CY_BLE_CONFIG_CONTR_CORE == CY_BLE_CORE_CORTEX_M4) && \
        (!defined BLE_1_uart_isr__INTC_CORTEXM4_ASSIGNED))
        #error Enable BLE_1_uart_isr interrupt for the ARM CM4 core in the interrupt configuration tab of \
            the Design-Wide Resources (DWR) file (project.cydwr)     
    #endif /* CY_BLE_CONFIG_CONTR_CORE == CY_BLE_CORE_CORTEX_M4 */
    
    #if((CY_BLE_CONFIG_CONTR_CORE == CY_BLE_CORE_CORTEX_M0P) && \
        (!defined BLE_1_uart_isr__INTC_CORTEXM0P_ASSIGNED))
        #error Enable BLE_1_uart_isr interrupt for the ARM CM0+ core in the interrupt configuration tab of \
            the Design-Wide Resources (DWR) file (project.cydwr)     
    #endif /* CY_BLE_CONFIG_CONTR_CORE == CY_BLE_CORE_CORTEX_M0P */
#endif /* (CY_BLE_CONFIG_STACK_MODE_CONTR_UART) */

/* Check for the proper HOST UART ISR configuration in the DWR.  */
#if(CY_BLE_CONFIG_STACK_MODE_HOST_UART)
    #if((CY_BLE_CONFIG_HOST_CORE == CY_BLE_CORE_CORTEX_M4) && \
        (!defined BLE_1_host_uart_isr__INTC_CORTEXM4_ASSIGNED))
        #error Enable BLE_1_host_uart_isr interrupt for the ARM CM4 core in the interrupt configuration tab of \
            the Design-Wide Resources (DWR) file (project.cydwr)     
    #endif /* CY_BLE_CONFIG_HOST_CORE == CY_BLE_CORE_CORTEX_M4 */
    
    #if((CY_BLE_CONFIG_HOST_CORE == CY_BLE_CORE_CORTEX_M0P) && \
        (!defined BLE_1_host_uart_isr__INTC_CORTEXM0P_ASSIGNED))
        #error Enable BLE_1_host_uart_isr interrupt for the ARM CM0+ core in the interrupt configuration tab of \
            the Design-Wide Resources (DWR) file (project.cydwr)     
    #endif /* CY_BLE_CONFIG_HOST_CORE == CY_BLE_CORE_CORTEX_M0P */
#endif /* (CY_BLE_CONFIG_STACK_MODE_HOST_UART) */

/** 
 * The maximum number of BLE connections.
 * This parameter displays how many BLE connections (both Central and 
 * Peripheral) are allowed. The valid range is from 1 to 4.
 */
#define CY_BLE_CONFIG_CONN_COUNT                    (1u)

/** The number of BLE connections (client). */
#define CY_BLE_CONFIG_GATTC_COUNT                   (0x00u)

/** The number of GAP Peripheral configurations structures. */
#define CY_BLE_CONFIG_GAP_PERIPHERAL_COUNT          (0x01u)

/** The number of GAP Broadcaster configurations structures. */
#define CY_BLE_CONFIG_GAP_BROADCASTER_COUNT         (0x00u)

/** The number of GAP Central configurations structures. */
#define CY_BLE_CONFIG_GAP_CENTRAL_COUNT             (0x00u)

/** The number of GAP Observer configurations structures. */
#define CY_BLE_CONFIG_GAP_OBSERVER_COUNT            (0x00u)

/** The number of Security configurations structures. */
#define CY_BLE_CONFIG_AUTH_INFO_COUNT               (0x01u)

/** LL Privacy 1.2 feature. */
#define CY_BLE_CONFIG_ENABLE_LL_PRIVACY             (0x01u)

/** LE 2 Mbps feature. */
#define CY_BLE_CONFIG_ENABLE_PHY_UPDATE             (0u)

/** Radio power calibration. */
#define CY_BLE_CONFIG_TX_POWER_CALIBRATION_ENABLE   (0u)      

/** The GAP security level. */
#define CY_BLE_CONFIG_GAP_SECURITY_LEVEL            (0x00u)

/** 
 * Sharing mode.
 * This option is used in the over-the-air (OTA) implementation. It allows 
 * sharing the BLE component code between two component instances: one instance
 * with profile-specific code and one with the stack.  
 * The following defined values can be used:
 * CY_BLE_SHARING_NONE   (0u) - The OTA feature is disabled.
 * CY_BLE_SHARING_EXPORT (1u) - Stack and Profiles.
 * CY_BLE_SHARING_IMPORT (2u) - Profile only.
 */
#define CY_BLE_CONFIG_SHARING_MODE                  (0u)

/**
 * The GAP Role. 
 * The following defined masks can be used:
 * CY_BLE_GAP_PERIPHERAL  (0x01u) - The device operates as peripheral.
 * CY_BLE_GAP_CENTRAL     (0x02u) - The device operates as central. 
 * CY_BLE_GAP_BROADCASTER (0x04u) - The device operates as a broadcaster.
 * CY_BLE_GAP_OBSERVER    (0x08u) - The device operates as an observer.
 * CY_BLE_GAP_HCI         (0x00u) - Used when the BLE operates in HCI mode.
 */ 
#define CY_BLE_CONFIG_GAP_ROLE                      (0x01u)

/** The Bonding Requirement. */
#define CY_BLE_CONFIG_BONDING_REQUIREMENT           (0x00u)

/** The maximum number of bonded devices to be supported by this device.  */
#define CY_BLE_CONFIG_MAX_BONDED_DEVICES            (16u)

/** 
 * The maximum number of peer devices whose addresses should be resolved 
 * by this device.
 */
#define CY_BLE_CONFIG_MAX_RESOLVABLE_DEVICES        (16u)

/** The maximum number of devices that can be added to the white list. */
#define CY_BLE_CONFIG_MAX_WHITE_LIST_SIZE           (16u)

#define CY_BLE_SECURITY_CONFIGURATION_0_INDEX   (0x00u)

#define CY_BLE_ADV_PKT_0_INDEX_FLAGS   (0x00u)
#define CY_BLE_ADV_PKT_0_INDEX_LOCAL_NAME   (0x03u)
#define CY_BLE_PERIPHERAL_CONFIGURATION_0_INDEX   (0x00u)


/* The additional queue depth provided by the customizer.  */
#define CY_BLE_CONFIG_ADD_Q_DEPTH_PER_CONN          (0u)

/**
 * GATT MTU Size.
 * The maximum Transmission Unit size (bytes) of an attribute to be used in the design.
 * The valid range is from 23 to 512 bytes. 
 * This value is used to respond to an Exchange MTU request from the GATT Client.
 */
#define CY_BLE_CONFIG_GATT_MTU                      (0x0017u)

/** The GATT Maximum attribute length. */
#define CY_BLE_CONFIG_GATT_DB_MAX_VALUE_LEN         (0x0024u)
#define CY_BLE_GATT_DB_INDEX_COUNT                  (0x003Fu)

/** The number of characteristics supporting the Reliable Write property. */
#define CY_BLE_CONFIG_GATT_RELIABLE_CHAR_COUNT      (0x0000u)

/** The total length of characteristics with the Reliable Write property. */
#define CY_BLE_CONFIG_GATT_RELIABLE_CHAR_LENGTH     (0x0000u)

/** 
 * The parameter to enable an application to provide a dynamically allocated
 * buffer for preparing a Write request.  
 */            
#define CY_BLE_CONFIG_GATT_ENABLE_EXTERNAL_PREP_WRITE_BUFF   (0u)

/** The parameter to enable the configuration of the L2CAP logical channels. */
#define CY_BLE_CONFIG_L2CAP_ENABLE                  (1u)
    
#if(CY_BLE_CONFIG_L2CAP_ENABLE != 0u)
    /** L2CAP MTU Size. */
    #define CY_BLE_CONFIG_L2CAP_MTU                     (23u)
    
    /** L2CAP MPS Size. */
    #define CY_BLE_CONFIG_L2CAP_MPS                     (23u)
    
