UNSW-Neural-Stimulator/neural_stimulator_firmware_2022/firmware/BLE_DAC/BLE_DAC/NSTIM.cydsn/Generated_Source/PSoC6/BLE_config.h
    /** The number of L2CAP Logical channels. */
    #define CY_BLE_CONFIG_L2CAP_LOGICAL_CHANNEL_COUNT   (1u) 

    /** Number of L2CAP PSMs. */
    #define CY_BLE_CONFIG_L2CAP_PSM_COUNT               (1u)
#endif  /* CY_BLE_L2CAP_ENABLE != 0u */

#define CY_BLE_CONFIG_GATT_DB_ATT_VAL_COUNT         (0x37u)

/** Max Tx payload size. */
#define CY_BLE_CONFIG_LL_MAX_TX_PAYLOAD_SIZE        (0x1Bu)

/** Max Rx payload size. */
#define CY_BLE_CONFIG_LL_MAX_RX_PAYLOAD_SIZE        (0x1Bu)

/** GATT Role. */
#define CY_BLE_CONFIG_GATT_ROLE                     (0x01u)
#define CY_BLE_CONFIG_GATT_DB_CCCD_COUNT            (0x02u)

/** Max unique services in the project. */
#define CY_BLE_MAX_SRVI                             (0x01u)

/***************************************
* API Constants for BLE services
* (using in cy_ble_<service>.h)
***************************************/

/* HIDS */
/** The maximum supported count of HID services for the GATT Server role. */
#define CY_BLE_CONFIG_HIDSS_SERVICE_COUNT           (0x00u)

/** The maximum supported count of HID reports for the GATT Server role. */
#define CY_BLE_CONFIG_HIDSS_REPORT_COUNT            (0x00u)
    
/** The maximum supported count of HID services for the GATT Client role. */
#define CY_BLE_CONFIG_HIDSC_SERVICE_COUNT           (0x00u)

/** The maximum supported count of HID reports for the GATT Client role.  */
#define CY_BLE_CONFIG_HIDSC_REPORT_COUNT            (0x00u)





/* BAS */
/** The maximum supported count of BAS services for the GATT Server role. */
#define CY_BLE_CONFIG_BASS_SERVICE_COUNT            (0x00u)

/** The maximum supported count of BAS reports for the GATT Client role. */
#define CY_BLE_CONFIG_BASC_SERVICE_COUNT            (0x00u)



/* ESS */
/** The maximum supported count of ESS characteristics for the GATT Client role. */
#define CY_BLE_CONFIG_ES_TOTAL_CHAR_COUNT           (0x00u)

/* AIOS */
/** The maximum supported count of AIOS characteristics for the GATT Client role. */
#define CY_BLE_CONFIG_AIO_TOTAL_CHAR_COUNT          (0x00u)

/* CUSTOM */
/** The maximum supported count of Custom services for the GATT Server role. */
#define CY_BLE_CONFIG_CUSTOMS_SERVICE_COUNT         (0x03u)

/** The maximum supported count of Custom services for the GATT Client role. */
#define CY_BLE_CONFIG_CUSTOMC_SERVICE_COUNT         (0x00u)

/** The maximum supported count of the Custom Service characteristics. */
#define CY_BLE_CONFIG_CUSTOM_SERVICE_CHAR_COUNT     (0x06u)

/** The maximum supported count of the Custom Service descriptors in one characteristic. */
#define CY_BLE_CONFIG_CUSTOM_SERVICE_CHAR_DESCRIPTORS_COUNT  (0x02u)

/**
 * Below are the indexes and handles of the defined Custom Services and 
 * their characteristics.
 */
#define CY_BLE_NSTIM_SERVICE_INDEX   (0x00u) /* Index of nstim service in the cy_ble_customs array */
#define CY_BLE_NSTIM_COMMAND_CHAR_INDEX   (0x00u) /* Index of command characteristic */
#define CY_BLE_NSTIM_COMMAND_CUSTOM_DESCRIPTOR_DESC_INDEX   (0x00u) /* Index of Custom Descriptor descriptor */
#define CY_BLE_NSTIM_COMMAND_CHARACTERISTIC_USER_DESCRIPTION_DESC_INDEX   (0x01u) /* Index of Characteristic User Description descriptor */
#define CY_BLE_NSTIM_ERR_CHAR_INDEX   (0x01u) /* Index of err characteristic */
#define CY_BLE_NSTIM_ERR_CUSTOM_DESCRIPTOR_DESC_INDEX   (0x00u) /* Index of Custom Descriptor descriptor */
#define CY_BLE_NSTIM_ERR_CHARACTERISTIC_USER_DESCRIPTION_DESC_INDEX   (0x01u) /* Index of Characteristic User Description descriptor */
#define CY_BLE_NSTIM_STIM_STATE_CHAR_INDEX   (0x02u) /* Index of stim_state characteristic */
#define CY_BLE_NSTIM_STIM_STATE_CUSTOM_DESCRIPTOR_DESC_INDEX   (0x00u) /* Index of Custom Descriptor descriptor */
#define CY_BLE_NSTIM_STIM_STATE_CHARACTERISTIC_USER_DESCRIPTION_DESC_INDEX   (0x01u) /* Index of Characteristic User Description descriptor */

#define CY_BLE_DC_SERV_SERVICE_INDEX   (0x01u) /* Index of dc_serv service in the cy_ble_customs array */
#define CY_BLE_DC_SERV_TAR_CURR_CHAR_INDEX   (0x00u) /* Index of tar_curr characteristic */
#define CY_BLE_DC_SERV_TAR_CURR_R_VDAC_TAR_DESC_DESC_INDEX   (0x00u) /* Index of r_vdac_tar_desc descriptor */
#define CY_BLE_DC_SERV_TAR_CURR_CHARACTERISTIC_USER_DESCRIPTION_DESC_INDEX   (0x01u) /* Index of Characteristic User Description descriptor */
#define CY_BLE_DC_SERV_BASE_CURR_CHAR_INDEX   (0x01u) /* Index of base_curr characteristic */
#define CY_BLE_DC_SERV_BASE_CURR_R_VDAC_BASE_DESC_INDEX   (0x00u) /* Index of r_vdac_base descriptor */
#define CY_BLE_DC_SERV_BASE_CURR_CHARACTERISTIC_USER_DESCRIPTION_DESC_INDEX   (0x01u) /* Index of Characteristic User Description descriptor */
#define CY_BLE_DC_SERV_TIMING_CHAR_INDEX   (0x02u) /* Index of timing characteristic */
#define CY_BLE_DC_SERV_TIMING_CUSTOM_DESCRIPTOR_DESC_INDEX   (0x00u) /* Index of Custom Descriptor descriptor */
#define CY_BLE_DC_SERV_TIMING_CHARACTERISTIC_USER_DESCRIPTION_DESC_INDEX   (0x01u) /* Index of Characteristic User Description descriptor */
#define CY_BLE_DC_SERV_PULSES_CHAR_INDEX   (0x03u) /* Index of pulses characteristic */
#define CY_BLE_DC_SERV_PULSES_CUSTOM_DESCRIPTOR_DESC_INDEX   (0x00u) /* Index of Custom Descriptor descriptor */

#define CY_BLE_AC_SERV_SERVICE_INDEX   (0x02u) /* Index of ac_serv service in the cy_ble_customs array */
#define CY_BLE_AC_SERV_PULSES_CHAR_INDEX   (0x00u) /* Index of pulses characteristic */
#define CY_BLE_AC_SERV_PULSES_CUSTOM_DESCRIPTOR_DESC_INDEX   (0x00u) /* Index of Custom Descriptor descriptor */
#define CY_BLE_AC_SERV_BURSTS_CHAR_INDEX   (0x01u) /* Index of bursts characteristic */
#define CY_BLE_AC_SERV_BURSTS_CUSTOM_DESCRIPTOR_DESC_INDEX   (0x00u) /* Index of Custom Descriptor descriptor */
#define CY_BLE_AC_SERV_P1_CURR_CHAR_INDEX   (0x02u) /* Index of p1_curr characteristic */
#define CY_BLE_AC_SERV_P1_CURR_CUSTOM_DESCRIPTOR_DESC_INDEX   (0x00u) /* Index of Custom Descriptor descriptor */
#define CY_BLE_AC_SERV_P2_CURR_CHAR_INDEX   (0x03u) /* Index of p2_curr characteristic */
#define CY_BLE_AC_SERV_P2_CURR_CUSTOM_DESCRIPTOR_DESC_INDEX   (0x00u) /* Index of Custom Descriptor descriptor */
#define CY_BLE_AC_SERV_ANODIC_CHAR_INDEX   (0x04u) /* Index of anodic characteristic */
#define CY_BLE_AC_SERV_ANODIC_CUSTOM_DESCRIPTOR_DESC_INDEX   (0x00u) /* Index of Custom Descriptor descriptor */
#define CY_BLE_AC_SERV_TIMING_CHAR_INDEX   (0x05u) /* Index of timing characteristic */
#define CY_BLE_AC_SERV_TIMING_CUSTOM_DESCRIPTOR_DESC_INDEX   (0x00u) /* Index of Custom Descriptor descriptor */


#define CY_BLE_NSTIM_SERVICE_HANDLE   (0x0010u) /* Handle of nstim service */
#define CY_BLE_NSTIM_COMMAND_DECL_HANDLE   (0x0011u) /* Handle of command characteristic declaration */
#define CY_BLE_NSTIM_COMMAND_CHAR_HANDLE   (0x0012u) /* Handle of command characteristic */
#define CY_BLE_NSTIM_COMMAND_CUSTOM_DESCRIPTOR_DESC_HANDLE   (0x0013u) /* Handle of Custom Descriptor descriptor */
#define CY_BLE_NSTIM_COMMAND_CHARACTERISTIC_USER_DESCRIPTION_DESC_HANDLE   (0x0014u) /* Handle of Characteristic User Description descriptor */
#define CY_BLE_NSTIM_ERR_DECL_HANDLE   (0x0015u) /* Handle of err characteristic declaration */
#define CY_BLE_NSTIM_ERR_CHAR_HANDLE   (0x0016u) /* Handle of err characteristic */
#define CY_BLE_NSTIM_ERR_CUSTOM_DESCRIPTOR_DESC_HANDLE   (0x0017u) /* Handle of Custom Descriptor descriptor */
#define CY_BLE_NSTIM_ERR_CHARACTERISTIC_USER_DESCRIPTION_DESC_HANDLE   (0x0018u) /* Handle of Characteristic User Description descriptor */
#define CY_BLE_NSTIM_STIM_STATE_DECL_HANDLE   (0x0019u) /* Handle of stim_state characteristic declaration */
#define CY_BLE_NSTIM_STIM_STATE_CHAR_HANDLE   (0x001Au) /* Handle of stim_state characteristic */
#define CY_BLE_NSTIM_STIM_STATE_CUSTOM_DESCRIPTOR_DESC_HANDLE   (0x001Bu) /* Handle of Custom Descriptor descriptor */
#define CY_BLE_NSTIM_STIM_STATE_CHARACTERISTIC_USER_DESCRIPTION_DESC_HANDLE   (0x001Cu) /* Handle of Characteristic User Description descriptor */

#define CY_BLE_DC_SERV_SERVICE_HANDLE   (0x001Du) /* Handle of dc_serv service */
#define CY_BLE_DC_SERV_TAR_CURR_DECL_HANDLE   (0x001Eu) /* Handle of tar_curr characteristic declaration */
#define CY_BLE_DC_SERV_TAR_CURR_CHAR_HANDLE   (0x001Fu) /* Handle of tar_curr characteristic */
#define CY_BLE_DC_SERV_TAR_CURR_R_VDAC_TAR_DESC_DESC_HANDLE   (0x0020u) /* Handle of r_vdac_tar_desc descriptor */
#define CY_BLE_DC_SERV_TAR_CURR_CHARACTERISTIC_USER_DESCRIPTION_DESC_HANDLE   (0x0021u) /* Handle of Characteristic User Description descriptor */
#define CY_BLE_DC_SERV_BASE_CURR_DECL_HANDLE   (0x0022u) /* Handle of base_curr characteristic declaration */
#define CY_BLE_DC_SERV_BASE_CURR_CHAR_HANDLE   (0x0023u) /* Handle of base_curr characteristic */
#define CY_BLE_DC_SERV_BASE_CURR_R_VDAC_BASE_DESC_HANDLE   (0x0024u) /* Handle of r_vdac_base descriptor */
#define CY_BLE_DC_SERV_BASE_CURR_CHARACTERISTIC_USER_DESCRIPTION_DESC_HANDLE   (0x0025u) /* Handle of Characteristic User Description descriptor */
#define CY_BLE_DC_SERV_TIMING_DECL_HANDLE   (0x0026u) /* Handle of timing characteristic declaration */
#define CY_BLE_DC_SERV_TIMING_CHAR_HANDLE   (0x0027u) /* Handle of timing characteristic */
#define CY_BLE_DC_SERV_TIMING_CUSTOM_DESCRIPTOR_DESC_HANDLE   (0x0028u) /* Handle of Custom Descriptor descriptor */
#define CY_BLE_DC_SERV_TIMING_CHARACTERISTIC_USER_DESCRIPTION_DESC_HANDLE   (0x0029u) /* Handle of Characteristic User Description descriptor */
#define CY_BLE_DC_SERV_PULSES_DECL_HANDLE   (0x002Au) /* Handle of pulses characteristic declaration */
#define CY_BLE_DC_SERV_PULSES_CHAR_HANDLE   (0x002Bu) /* Handle of pulses characteristic */
#define CY_BLE_DC_SERV_PULSES_CUSTOM_DESCRIPTOR_DESC_HANDLE   (0x002Cu) /* Handle of Custom Descriptor descriptor */

#define CY_BLE_AC_SERV_SERVICE_HANDLE   (0x002Du) /* Handle of ac_serv service */
#define CY_BLE_AC_SERV_PULSES_DECL_HANDLE   (0x002Eu) /* Handle of pulses characteristic declaration */
#define CY_BLE_AC_SERV_PULSES_CHAR_HANDLE   (0x002Fu) /* Handle of pulses characteristic */
#define CY_BLE_AC_SERV_PULSES_CUSTOM_DESCRIPTOR_DESC_HANDLE   (0x0030u) /* Handle of Custom Descriptor descriptor */
#define CY_BLE_AC_SERV_BURSTS_DECL_HANDLE   (0x0031u) /* Handle of bursts characteristic declaration */
#define CY_BLE_AC_SERV_BURSTS_CHAR_HANDLE   (0x0032u) /* Handle of bursts characteristic */
#define CY_BLE_AC_SERV_BURSTS_CUSTOM_DESCRIPTOR_DESC_HANDLE   (0x0033u) /* Handle of Custom Descriptor descriptor */
#define CY_BLE_AC_SERV_P1_CURR_DECL_HANDLE   (0x0034u) /* Handle of p1_curr characteristic declaration */
#define CY_BLE_AC_SERV_P1_CURR_CHAR_HANDLE   (0x0035u) /* Handle of p1_curr characteristic */
#define CY_BLE_AC_SERV_P1_CURR_CUSTOM_DESCRIPTOR_DESC_HANDLE   (0x0036u) /* Handle of Custom Descriptor descriptor */
#define CY_BLE_AC_SERV_P2_CURR_DECL_HANDLE   (0x0037u) /* Handle of p2_curr characteristic declaration */
#define CY_BLE_AC_SERV_P2_CURR_CHAR_HANDLE   (0x0038u) /* Handle of p2_curr characteristic */
#define CY_BLE_AC_SERV_P2_CURR_CUSTOM_DESCRIPTOR_DESC_HANDLE   (0x0039u) /* Handle of Custom Descriptor descriptor */
#define CY_BLE_AC_SERV_ANODIC_DECL_HANDLE   (0x003Au) /* Handle of anodic characteristic declaration */
#define CY_BLE_AC_SERV_ANODIC_CHAR_HANDLE   (0x003Bu) /* Handle of anodic characteristic */
#define CY_BLE_AC_SERV_ANODIC_CUSTOM_DESCRIPTOR_DESC_HANDLE   (0x003Cu) /* Handle of Custom Descriptor descriptor */
#define CY_BLE_AC_SERV_TIMING_DECL_HANDLE   (0x003Du) /* Handle of timing characteristic declaration */
#define CY_BLE_AC_SERV_TIMING_CHAR_HANDLE   (0x003Eu) /* Handle of timing characteristic */
#define CY_BLE_AC_SERV_TIMING_CUSTOM_DESCRIPTOR_DESC_HANDLE   (0x003Fu) /* Handle of Custom Descriptor descriptor */



/** @} group_macros */

#ifdef __cplusplus
}
#endif /* __cplusplus */
#endif /* CY_BLE_CONFIG_H */

/* [] END OF FILE */
